Show / Hide Table of Contents
Class MatSteelEc2
Material steel Ec2
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatSteel
MatSteelEc2
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatSteelECEN,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelEc2 : MatSteel
Examples
This sample shows how to create steel material.
//Creating the model
OpenModel openModel = new OpenModel();
//Steel material
MatSteelEc2 matS = new MatSteelEc2();
matS.Name = "S275";
matS.UnitMass = 7850.0;
matS.E = 200e9;
matS.Poisson = 0.2;
matS.G = 83.333e9;
matS.SpecificHeat = 0.6;
matS.ThermalExpansion = 0.00001;
matS.ThermalConductivity = 45;
matS.fy = 235e6;
matS.fu = 360e6;
matS.fy40 = 215e6;
matS.fu40 = 340e6;
//Setting thermal characteristcs of material (in this case by the code)
matS.StateOfThermalConductivity = ThermalConductivityState.Code;
matS.StateOfThermalExpansion = ThermalExpansionState.Code;
matS.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matS.StateOfThermalStressStrain = ThermalStressStrainState.Code;
matS.DiagramType = SteelDiagramType.Bilinear;
openModel.AddObject(matS);
Properties
Improve this Doc   View Source
DiagramType
Type of material diagram
Declaration
public SteelDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 SteelDiagramType
Improve this Doc   View Source
fu
Ultimate strength for nominal thickness of the element <= 40mm - fu
Declaration
public double fu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fu40
Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
Declaration
public double fu40 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fy
Yield strength for nominal thickness of the element <= 40mm - fy
Declaration
public double fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fy40
Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
Declaration
public double fy40 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserDiagram
Stress-strain diagram defined by user
Declaration
public Polygon2D UserDiagram { get; set; }
Property Value
 Type |  Description
 Polygon2D
 Improve this Doc
 View Source